[
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بيكي، الصداع الشديد ده ممكن يكون مزعج جداً وممكن يكون ليه أسباب كتير، زي:\n\n*   **الإجهاد أو قلة النوم:** ودي من أكتر الأسباب شيوعاً.\n*   **الجفاف:** لو مش بتشربي مياه كفاية.\n*   **الجيوب الأنفية:** التهاب الجيوب الأنفية ممكن يسبب صداع في الوش والراس.\n*   **مشاكل في النظر:** لو محتاجة نظارة أو النظارة اللي بتلبسيها مش مناسبة.\n*   **الصداع النصفي (الشقيقة):** وده بيكون ليه أعراض مميزة زي نبض في الراس، حساسية للضوء والصوت.\n*   **ارتفاع أو انخفاض ضغط الدم:** وده ممكن يسبب صداع.\n*   **التوتر والقلق:** بيزودوا الصداع.\n*   **أسباب أخرى:** نادرة زي مشاكل في الأسنان أو الأذن، أو في حالات نادرة جداً ممكن تكون أسباب أخطر.\n\n**إيه اللي ممكن تعمليه دلوقتي؟**\n\n*   **الراحة:** حاولي ترتاحي في مكان هادي ومظلم.\n*   **المياه:** اشربي كمية كافية من المياه.\n*   **كمادات باردة:** ممكن تحطي كمادات باردة على جبهتك أو مؤخرة رقبتك.\n*   **مسكنات الألم:** لو عندك أي مسكن بسيط زي الباراسيتامول أو الإيبوبروفين (لو مفيش موانع صحية ليكي) ممكن تاخدي جرعة بسيطة.\n\n**مهم جداً:** بما إن الصداع شديد، لازم تتابعي حالتك. لو الصداع استمر، أو زادت شدته، أو ظهرت معاه أي أعراض تانية زي:\n\n*   زغللة في العين\n*   تنميل في أطراف الجسم\n*   ترجيع\n*   سخونية\n*   تصلب في الرقبة\n*   صداع بيصحيكي من النوم\n\nفي الحالات دي، لازم تروحي للدكتور فوراً عشان يقيم الحالة بشكل دقيق ويشوف السبب ويعرف إيه العلاج المناسب ليكي.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T01:49:41.931858"
  },
  {
    "q": "عايز اعمل نظام غذاءب",
    "a": "أهلاً بيك! عشان أقدر أساعدك في نظام غذائي مناسب ليك، محتاج أعرف كام حاجة:\n\n1.  **إيه هدفك من النظام الغذائي؟** (مثلاً: عايز تخس، عايز تحافظ على وزنك، عايز تزود وزنك، أو لأي هدف صحي معين زي تنظيم سكر الدم أو تحسين الهضم؟)\n2.  **هل عندك أي أمراض مزمنة أو حساسية من أكل معين؟** (زي السكر، الضغط، حساسية الجلوتين، حساسية الألبان، إلخ.)\n3.  **هل فيه أكلات معينة بتحبها أو مبتفضلهاش؟** (مثلاً: بتحب اللحوم، بتفضل الأكل النباتي، مبتستحملش بعض أنواع الخضار؟)\n\nلما أعرف المعلومات دي، هقدر أقدملك اقتراح لنظام غذائي مبدئي بسيط ومناسب لاحتياجاتك.\n\nمستني ردك!\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T01:52:36.629148"
  },
  {
    "q": "عايز ابقى نيكككككككككككك",
    "a": "أنا آسف، لكن لا أستطيع التعامل مع هذا النوع من الكلام. لو عندك أي أسئلة طبية أو محتاج مساعدة في مجال الصحة، أنا موجود للمساعدة.",
    "timestamp": "2025-06-12T01:52:55.707567"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بك! الصداع الشديد ممكن يكون مرهق ومقلق جدًا. فيه أسباب كتير ممكن تعمل صداع شديد، زي:\n\n*   **الإجهاد أو التوتر:** ده سبب شائع جدًا للصداع.\n*   **قلة النوم:** عدم أخذ قسط كافي من النوم ممكن يؤدي لصداع.\n*   **الجفاف:** لو جسمك مش واخد كفايته من الماية، ده ممكن يسبب صداع.\n*   **صداع التوتر:** ده نوع شائع من الصداع اللي بيحسس إن فيه ضغط حوالين الراس.\n*   **الصداع النصفي (الشقيقة):** ده بيكون صداع شديد جدًا وممكن يجي معاه غثيان أو حساسية للضوء والصوت.\n*   **مشاكل في الجيوب الأنفية:** التهاب الجيوب الأنفية ممكن يسبب صداع في منطقة الوجه والراس.\n*   **أسباب أخرى:** ممكن يكون الصداع له أسباب تانية زي مشاكل في النظر، أو الضغط العالي، أو حتى أسباب نادرة بتحتاج فحص طبي.\n\n**لحد ما تشوف دكتور، ممكن تجرب الآتي:**\n\n*   **الراحة:** حاول ترتاح في مكان هادي ومظلم.\n*   **السوائل:** اشرب كمية كافية من الماية.\n*   **كمادات باردة:** ممكن تحط كمادات باردة على جبهتك.\n\nبما إن الصداع شديد، **مهم جدًا إنك تروح لدكتور عشان يكشف عليك ويحدد السبب ويعرف إيه العلاج المناسب لحالتك.**\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T01:53:20.780534"
  },
  {
    "q": "عندي حمى وأعراض برد",
    "a": "أهلاً بك!\n\nواضح إنك بتمر بأعراض برد وحمى، ودي أعراض شائعة جداً. غالبًا بتكون بسبب فيروسات البرد أو الإنفلونزا.\n\nإليك بعض النصائح اللي ممكن تساعدك في البيت:\n\n1.  **الراحة:** الجسم بيحتاج راحة عشان يقدر يحارب الفيروس. حاول تنام كويس وماترهقش نفسك.\n2.  **السوائل:** اشرب سوائل دافية كتير زي الشوربة، الأعشاب (زي اليانسون والنعناع)، المية، والعصاير الطبيعية. ده بيساعد على تعويض السوائل اللي بتفقدها بسبب الحمى وبيخفف الاحتقان.\n3.  **خفض الحرارة:** ممكن تاخد دواء خافض للحرارة ومسكن للآلام زي الباراسيتامول (تأكد إن مفيش موانع عندك لاستخدامه واستشر الصيدلي لو مش متأكد).\n4.  **تخفيف الأعراض:** ممكن تستخدم نقط للأنف لو عندك احتقان شديد، أو أقراص استحلاب للحلق لو بيوجعك.\n5.  **التهوية:** حافظ على تهوية الغرفة اللي قاعد فيها.\n\nلو الأعراض دي استمرت أكتر من كام يوم، أو لو زادت حدتها، أو حسيت بضيق في التنفس، أو ألم شديد، أو لو الحمى كانت عالية جداً ومبتنزلش، يبقى لازم تشوف دكتور.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T01:54:53.581608"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بيكي/بيك! الصداع الشديد ده حاجة مقلقة وممكن تكون ليها أسباب كتير.\n\nممكن يكون سببه حاجات بسيطة زي:\n*   قلة النوم\n*   الجفاف (مش بتشرب مية كفاية)\n*   الإجهاد أو التوتر\n*   إرهاق العين (لو بتقعد كتير قدام شاشات)\n\nوممكن أحيانًا يكون ليه أسباب تانية محتاجة كشف طبي زي:\n*   مشاكل في الجيوب الأنفية\n*   الصداع النصفي (الشقيقة)\n*   ارتفاع ضغط الدم\n*   أو أسباب تانية أقل شيوعًا لكن مهم الدكتور يبص عليها.\n\nلو الصداع شديد ومستمر، أو معاه أعراض تانية زي:\n*   زغللة في العين\n*   غثيان أو قيء\n*   تنميل في أطراف الجسم\n*   تصلب الرقبة\n*   حمى\n*   تغير في الوعي\n\n**لازم تروح لدكتور في أقرب وقت ممكن عشان يقيم حالتك ويشوف السبب بالظبط ويوصفلك العلاج المناسب.**\n\nلحد ما تروح للدكتور، ممكن تحاول تعمل الآتي:\n*   اشرب مية كتير.\n*   خد قسط كافي من الراحة في مكان هادي ومظلم.\n*   حاول تبعد عن أي توتر أو إجهاد.\n*   ممكن تاخد مسكن بسيط زي الباراسيتامول لو مفيش موانع طبية.\n\nسلامتك ألف سلامة!\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T01:56:57.000812"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بك، الصداع الشديد ممكن يكون مزعج جداً، وفي أسباب كتير ممكن تسبب الصداع، منها:\n\n*   **التوتر والإجهاد:** ده من أكتر الأسباب شيوعاً.\n*   **قلة النوم:** عدم أخذ قسط كافي من النوم ممكن يسبب صداع.\n*   **الجفاف:** عدم شرب كمية كافية من المياه.\n*   **إرهاق العين:** لو بتقضي وقت طويل قدام الشاشات.\n*   **الجيوب الأنفية:** التهابات الجيوب ممكن تسبب صداع في الوجه والرأس.\n*   **تغييرات في مستويات الهرمونات:** خاصة عند السيدات.\n*   **بعض الأطعمة والمشروبات:** زي الكافيين لو كنت متعود عليه وقللته فجأة، أو بعض أنواع الجبن.\n\n**إمتى لازم تقلق وتشوف دكتور؟**\nلو الصداع شديد جداً ومش بيخف بمسكنات عادية، أو لو معاه أعراض تانية زي:\n*   سخونة شديدة.\n*   تغير في الرؤية.\n*   تنميل أو ضعف في جانب من الجسم.\n*   قيء مستمر.\n*   تصلب في الرقبة.\n*   لو الصداع ظهر فجأة وبشكل غير مسبوق في شدته (أسوأ صداع في حياتك).\n*   لو بتعاني من أمراض مزمنة زي الضغط أو السكر.\n\n**إيه اللي ممكن تعمله مؤقتاً عشان ترتاح؟**\n*   حاول تاخد قسط من الراحة في مكان هادي ومظلم.\n*   اشرب كمية كافية من المياه.\n*   ممكن تحط كمادات باردة على جبهتك أو مؤخرة رقبتك.\n*   ابتعد عن الإجهاد والتوتر قدر الإمكان.\n\nأتمنى تكون بخير وتتحسن قريب.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T02:11:19.349655"
  },
  {
    "q": "أعمل إيه لو حد اغمى عليه؟",
    "a": "لو حد أُغمى عليه، أهم حاجة إنك تتصرف بهدوء وتتبع الخطوات دي:\n\n1.  **تأكد من سلامة المكان:** بص حواليك واتأكد إن مفيش حاجة ممكن تؤذيه وهو واقع أو لما يفوق، وشيل أي عوائق.\n2.  **خليه يستلقي وارفعل رجليه:** خليه ينام على ظهره، وحاول ترفع رجليه لفوق حوالي 30 سم (ممكن تحط تحت رجليه مخدة، شنطة، أو أي حاجة متاحة). ده بيساعد الدم يرجع للمخ.\n3.  **فك أي ملابس ضيقة:** لو لابس حاجة ضيقة حوالين الرقبة أو الصدر (زي كرافتة أو ياقة قميص)، فكها عشان يتنفس براحته.\n4.  **تأكد من التهوية الجيدة:** افتح شبابيك لو متاح، وخلي الناس تبعد عنه عشان ياخد هوا نقي ومفيش زحمة حواليه.\n5.  **متديلوش أي حاجة يشربها أو ياكلها وهو فاقد الوعي.**\n6.  **راقبه:** بص على نفسه، شوف بيتنفس طبيعي ولا لأ.\n7.  **امتى تطلب المساعدة الطبية (الإسعاف 123 في مصر)؟**\n    *   لو مفاقش في خلال دقيقة أو دقيقتين.\n    *   لو كان عنده أي أمراض مزمنة (زي السكر أو القلب).\n    *   لو اتخبط في دماغه أو اتصاب وهو بيقع.\n    *   لو كان عنده نوبة تشنج أو أي أعراض تانية مقلقة.\n8.  **لما يفوق:** خليه يفضل مستلقي شوية وميقومش بسرعة، وممكن تديله مية أو عصير خفيف لو فاق تماماً وقدر يشرب.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T02:32:06.645241"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "عذراً، حدث خطأ في الحصول على الرد. يرجى المحاولة مرة أخرى.",
    "timestamp": "2025-06-12T06:47:17.469054"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بيكي/بيكِ، أنا متفهمة إن الصداع الشديد ممكن يكون مزعج جداً ومؤلم.\n\nالصداع ممكن يكون ليه أسباب كتير، أشهرها:\n*   **الإجهاد والتوتر:** ده سبب شائع جداً.\n*   **قلة النوم:** عدم أخذ قسط كافٍ من النوم ممكن يسبب صداع.\n*   **الجفاف:** عدم شرب كمية كافية من المياه.\n*   **إجهاد العين:** لو بتقضي وقت طويل قدام الشاشات.\n*   **بعض الأطعمة والمشروبات:** زي الكافيين لو بتشربه كتير وفجأة وقفته، أو بعض أنواع الجبن والشوكولاتة.\n*   **أمراض بسيطة:** زي نزلات البرد أو الإنفلونزا.\n*   **أسباب أخرى:** زي مشاكل الجيوب الأنفية، أو مشاكل في الأسنان، أو النظر.\n\n**لحد ما تقدري/تقدر تروحي/تروح للدكتور، ممكن تحاول/ي تعمل/ي الآتي:**\n1.  **الراحة:** ارتاح/ي في مكان هادي ومظلم بعيد عن الضوضاء.\n2.  **شرب المياه:** اشرب/ي كمية كافية من المياه على مدار اليوم عشان تتجنب/ي الجفاف.\n3.  **كمادات باردة:** ممكن تحط/ي كمادة باردة على جبهتك أو مؤخرة رقبتك.\n4.  **مسكنات الألم:** ممكن تاخد/ي مسكن ألم متاح بدون وصفة طبية زي الباراسيتامول (زي البنادول) أو الإيبوبروفين (زي البروفين)، بس طبعاً لازم تقرأ/ي النشرة الداخلية وتتأكد/ي إنه مناسب ليكي/ليك ومفيش أي موانع استخدام.\n\n**لكن لو الصداع شديد جداً ومستمر، أو لو معاه أي أعراض تانية زي:**\n*   زغللة في العين أو مشاكل في الرؤية\n*   حمى (سخونية)\n*   تصلب في الرقبة\n*   غثيان أو قيء\n*   ضعف أو تنميل في جزء من الجسم\n*   تغيير في الوعي أو الكلام\n*   أو لو الصداع ده أسوأ صداع حسيت/ي بيه في حياتك\n\n**في الحالات دي، لازم تروح/ي لدكتور فوراً عشان يقيم الحالة ويحدد السبب بالظبط ويكتبلك العلاج المناسب.**\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T06:48:42.082477"
  },
  {
    "q": "عندي حمى وأعراض برد",
    "a": "سلامتك ألف سلامة! الأعراض دي زي الحمى والبرد بتكون منتشرة جدًا، وغالبًا بتكون بسبب عدوى فيروسية.\n\nإليك بعض النصائح اللي ممكن تساعدك في البيت:\n\n1.  **الراحة:** الجسم بيحتاج يرتاح عشان يقدر يحارب العدوى. حاول تاخد قسط كافي من النوم.\n2.  **السوائل:** اشرب كميات كبيرة من السوائل الدافية زي الماية، الشوربة، الأعشاب (زي اليانسون أو الزنجبيل بالليمون والعسل). ده بيساعد على تعويض السوائل اللي الجسم بيفقدها ويخفف احتقان الزور.\n3.  **تخفيف الأعراض:** ممكن تاخد مسكنات خفيفة ومخفضة للحرارة (زي الباراسيتامول) لتخفيف الحمى وآلام الجسم، لكن اسأل الصيدلي عن الجرعة المناسبة ليك.\n4.  **الغرغرة:** لو عندك ألم في الزور، ممكن تعمل غرغرة بمية وملح دافية.\n\nلو الأعراض فضلت مستمرة لأكثر من كام يوم، أو زادت سوءًا، أو ظهرت عليك أعراض تانية مقلقة زي صعوبة في التنفس أو ألم شديد، لازم تشوف دكتور.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T10:28:27.883144"
  },
  {
    "q": "الذنه الكروي",
    "a": "أهلاً بك!\n\nأتوقع إنك تقصد \"الذئبة الحمراء\" (Systemic Lupus Erythematosus - SLE) لأن \"الذئبة\" بتتنطق أحياناً \"الذئبه\".\n\n**الذئبة الحمراء** هي مرض مزمن من أمراض المناعة الذاتية. ده معناه إن الجهاز المناعي في جسمك، اللي المفروض يحميك من البكتيريا والفيروسات، بيبدأ يهاجم أنسجة الجسم السليمة بالغلط على إنها أجسام غريبة.\n\nممكن تأثر الذئبة الحمراء على أجزاء كتير في الجسم زي:\n*   **المفاصل:** بتسبب ألم وتورم.\n*   **الجلد:** أشهر أعراضها طفح جلدي أحمر على الوش شبه شكل الفراشة (بيغطي الخدين والأنف)، وكمان ممكن يظهر طفح في أماكن تانية بتتعرض للشمس.\n*   **الكلى:** ممكن تسبب مشاكل في الكلى.\n*   **القلب والرئة:** ممكن تأثر على الأغشية المحيطة بيهم.\n*   **المخ والجهاز العصبي:** ممكن تسبب صداع أو مشاكل في التركيز.\n*   **أعراض تانية:** زي الإرهاق الشديد، والحمى، وتساقط الشعر، وقرح الفم.\n\nأعراض الذئبة بتختلف بشكل كبير من شخص للتاني، وممكن تكون خفيفة أو شديدة، وتظهر وتختفي على فترات.\n\nتشخيص الذئبة الحمراء بيكون صعب شوية لأنه بيعتمد على الأعراض والفحص البدني وبعض التحاليل المعينة. العلاج بيكون لتخفيف الأعراض والتحكم في نشاط المرض عشان ما يعملش تلف في الأعضاء، وبيكون تحت إشراف دكتور روماتيزم.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T10:59:38.917679"
  },
  {
    "q": "صداعع",
    "a": "أهلاً بك! الصداع ده شعور مش لطيف خالص وممكن يكون له أسباب كتير.\n\nممكن يكون بسبب:\n*   قلة النوم\n*   الجفاف (مش شرب مياه كفاية)\n*   التوتر أو الإجهاد\n*   إرهاق العين\n*   قلة الأكل (الجوع)\n\nإيه اللي ممكن تعمله دلوقتي عشان تحس بتحسن:\n1.  **اشرب مياه:** حاول تشرب كوباية مياه كبيرة.\n2.  **ارتاح:** حاول تاخد قسط من الراحة في مكان هادي وبعيد عن الضوء والصوت.\n3.  **كمادات باردة:** ممكن تحط كمادات باردة على جبهتك أو مؤخرة رقبتك.\n4.  **مسكنات:** لو الألم شديد ممكن تاخد مسكن بسيط زي الباراسيتامول أو الإيبوبروفين (لو مفيش موانع صحية ليك).\n\nلو الصداع شديد جدًا، أو مستمر لفترة طويلة، أو متكرر، أو مصحوب بأعراض تانية زي (سخونية، زغللة في العين، تنميل، قيء، تصلب رقبة)، يبقى لازم تكشف عشان الدكتور يشخص الحالة ويعرف السبب بالظبط.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T11:00:18.772351"
  },
  {
    "q": "عندي حمى وأعراض برد",
    "a": "عذراً، حدث خطأ في الحصول على الرد. يرجى المحاولة مرة أخرى.",
    "timestamp": "2025-06-12T12:05:49.359808"
  },
  {
    "q": "أعاني من صداع شديد",
    "a": "أهلاً بيك/ي! الصداع الشديد ممكن يكون مرهق جداً. فيه أسباب كتير ومختلفة للصداع، ممكن تكون بسيطة وممكن تكون محتاجة اهتمام طبي.\n\nبعض الأسباب الشائعة للصداع الشديد ممكن تكون:\n*   **الإجهاد أو التوتر:** ده سبب متكرر جداً.\n*   **الجفاف:** عدم شرب كمية كافية من المياه ممكن يسبب صداع.\n*   **قلة النوم:** النوم الغير كافي أو جودته مش كويسة.\n*   **إجهاد العين:** قضاء وقت طويل قدام الشاشات أو إجهاد العين بشكل عام.\n*   **الجيوب الأنفية:** التهاب الجيوب الأنفية ممكن يعمل صداع في الوجه والرأس.\n*   **الصداع النصفي (الشقيقة):** ده نوع من الصداع بيكون شديد جداً وممكن يكون معاه أعراض تانية زي الغثيان أو الحساسية للضوء والصوت.\n*   **مشاكل صحية أخرى:** في بعض الحالات الأقل شيوعاً، الصداع الشديد ممكن يكون عرض لمشكلة صحية تانية.\n\nمادام الصداع شديد، يفضل إنك تستريح في مكان هادي بعيد عن الضوء والضوضاء، وتشرب مية كفاية. لكن الأهم إنك لازم تروح لدكتور عشان يفحصك ويحدد سبب الصداع بالظبط ويقدر يوصفلك العلاج المناسب.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T12:06:07.122066"
  },
  {
    "q": "أعمل إيه لو حد اغمى عليه؟",
    "a": "لو حد أغمى عليه، دي خطوات بسيطة ممكن تعملها عشان تساعده:\n\n1.  **التأكد من الأمان:** أول حاجة، اتأكد إن المكان اللي فيه الشخص آمن، ومفيش أي حاجة ممكن تأذيه لو وقع أو هو فاق.\n2.  **مدّده على ضهره:** خلي الشخص ينام على ضهره على سطح مستوي.\n3.  **ارفع رجليه:** ارفع رجلين الشخص فوق مستوى قلبه بحوالي 30 سم (ممكن تحط مخدة أو أي حاجة تحت رجليه). ده بيساعد الدم يرجع للمخ.\n4.  **فك أي حاجة ضيقة:** لو لابس حاجة ضيقة حوالين الرقبة أو الوسط (زي ياقة قميص أو حزام)، فكها عشان تسهل التنفس والدورة الدموية.\n5.  **تهوية المكان:** افتح الشبابيك أو الأبواب عشان تدخل هواء نقي. ممكن تهوي عليه بهدوء لو الجو حر.\n6.  **تجنب الزحام:** خلي الناس تبعد عنه عشان ياخد هواء كافي.\n7.  **لا تحاول تفيق الشخص بالقوة:** يعني متصحيش الشخص بالرش بالماء أو الهز الشديد، سيبه ياخد وقته.\n8.  **بعد ما يفوق:** لما الشخص يفوق، متخلوش يقوم بسرعة. خليه يستريح وهو نايم شوية، وبعدين ممكن يقعد بالراحة، وقدم له شوية مية لو يقدر يشرب.\n9.  **متى تطلب المساعدة الطبية (تتصل بالإسعاف):**\n    *   لو مفاقش في خلال دقيقة أو دقيقتين.\n    *   لو عنده أي أعراض تانية مقلقة (زي ألم في الصدر، ضيق تنفس، تشنجات، كدمات).\n    *   لو سقط وارتطم رأسه.\n    *   لو معروف عنه إن عنده مشاكل صحية خطيرة (زي أمراض القلب أو السكر).\n    *   لو دي أول مرة يغمى عليه أو بتحصل له كتير.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T12:38:57.366307"
  },
  {
    "q": "عندي حمى وأعراض برد",
    "a": "أهلاً بيك! للأسف أعراض الحمى والبرد دي حاجة منتشرة جدًا وممكن تكون بسبب نزلة برد عادية أو إنفلونزا.\n\nإليك بعض النصائح اللي ممكن تساعدك تخفف الأعراض مؤقتًا:\n*   **الراحة:** حاول ترتاح على قد ما تقدر وتدي جسمك فرصة يستعيد طاقته.\n*   **السوائل:** اشرب كميات كبيرة من السوائل الدافية زي الماية، الشوربة، اليانسون، أو الليمون بالنعناع. دي بتساعد ترطب الزور وتخفف الاحتقان.\n*   **مسكنات الألم:** ممكن تاخد مسكنات ألم وخافضات حرارة زي الباراسيتامول (زي البنادول أو السيتال) أو الإيبوبروفين (زي البروفين) لو ماعندكش موانع صحية لاستخدامهم. اقرأ النشرة الداخلية للجرعة المناسبة.\n*   **التهوية:** خلي المكان اللي قاعد فيه متهوي كويس.\n\nلو الأعراض دي زادت، أو بقى فيه كحة شديدة، ضيق في التنفس، ألم في الصدر، أو حرارة عالية مستمرة، لازم تروح للدكتور.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T12:50:34.358961"
  },
  {
    "q": "عايز اكل ايه النهارده",
    "a": "أهلاً بك! عشان أقدر أساعدك وأقترح عليك أكلات مناسبة، ممكن أعرف منك كام حاجة:\n\n1.  **إيه هدفك من الأكل النهارده؟** (يعني عايز تخس، عايز أكل صحي عامة، عندك مشكلة صحية معينة زي سكر أو ضغط؟)\n2.  **إيه الأكلات اللي بتحبها أو مش بتحبها؟** (مثلاً في حاجات معينة مش بتاكلها زي اللحوم، أو عندك حساسية من أكل معين؟)\n3.  **إيه الميزانية التقريبية اللي ممكن نشتغل عليها؟** (عشان نقترح أكلات اقتصادية وموجودة.)\n\nعلى العموم، بشكل عام، ممكن أقترح عليك وجبات صحية وبسيطة ومتاحة:\n\n**مثال ليوم أكل صحي ومتوازن:**\n\n*   **الفطار:**\n    *   ساندويتش فول بالطحينة والزيت الحار في عيش بلدي (نص رغيف) مع طبق سلطة صغير (خيار وطماطم).\n    *   أو طبق جبنة قريش بالطماطم والخيار مع ربع رغيف عيش أسمر.\n*   **الغداء:**\n    *   طبق كبير خضار مطبوخ (زي فاصوليا خضرا، بسلة، سبانخ) مع قطعة بروتين (صدر فرخة مشوي أو مسلوق، أو قطعة سمك مشوي، أو بيضتين مسلوقين).\n    *   مع طبق رز صغير (4-5 معالق كبار) أو نصف رغيف عيش بلدي.\n    *   وطبق سلطة خضرا كبير.\n*   **العشاء:**\n    *   كوباية زبادي مع ثمرة فاكهة (تفاحة أو برتقالة).\n    *   أو طبق سلطة تونة (مع شوية زيت وخل) مع خضار.\n\nياريت تقولي معلومات أكتر عشان أقدر أساعدك بشكل أفضل!\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T12:51:13.158649"
  },
  {
    "q": "انا اعاني من ضيق تنفس انصحي اروح لدكتور تخضضه ايه",
    "a": "أهلاً بكِ،\n\nضيق التنفس ده عرض مهم ومحتاج متابعة. ممكن يكون له أسباب كتير ومختلفة، عشان كده مهم جداً إنك تكشفي عند دكتور عشان يعرف السبب ويحدد العلاج المناسب.\n\nأفضل تخصصات ممكن تبدأي بيها هي:\n\n1.  **دكتور أمراض صدرية (Pulmonologist):** ده التخصص الأساسي لأي مشاكل متعلقة بالجهاز التنفسي والرئة.\n2.  **دكتور باطنة (Internal Medicine):** دكتور الباطنة ممكن يعمل الفحص الأولي ويقيم حالتك، ولو احتاجتي، هيحولك للتخصص الأدق (زي الصدرية أو القلب).\n3.  **دكتور قلب (Cardiologist):** في بعض الحالات، مشاكل القلب ممكن تسبب ضيق في التنفس، فلو دكتور الباطنة شك في سبب قلبي، ممكن يحولك لدكتور قلب.\n\nنصيحتي الأهم هي إنك ما تتأخريش في الكشف عشان تعرفي السبب وتتعالجي بسرعة.\n\n⚠️ ده مش تشخيص طبي، لو الأعراض مستمرة أو زادت، لازم تروح لدكتور متخصص.",
    "timestamp": "2025-06-12T13:06:51.833216"
  }
]